work/WinVent/Kastenfenster/S01/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  12
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

9
(
    atmosphere_ground
    {
        type            wall;
        inGroups        List<word> 
2
(
atmosphere
wall
)
;
        nFaces          216;
        startFace       846182;
    }
    atmosphere_outlet
    {
        type            patch;
        inGroups        List<word> 1(atmosphere);
        nFaces          4618;
        startFace       846398;
    }
    walls
    {
        type            wall;
        inGroups        List<word> 
2
(
staticWalls
wall
)
;
        nFaces          26591;
        startFace       851016;
    }
    window
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          24099;
        startFace       877607;
    }
    outflow
    {
        type            patch;
        inGroups        List<word> 1(outflow);
        nFaces          896;
        startFace       901706;
    }
    glass_outside_top_master
    {
        type            mappedWall;
        inGroups        List<word> 
3
(
wall
mapped
glass_outside_top
)
;
        nFaces          2019;
        startFace       902602;
        neighbourRegion region0;
        neighbourPatch  glass_outside_top_slave;
        transformType   none;
        method          nearest;
    }
    glass_outside_top_slave
    {
        type            mappedWall;
        inGroups        List<word> 
3
(
wall
mapped
glass_outside_top
)
;
        nFaces          2019;
        startFace       904621;
        neighbourRegion region0;
        neighbourPatch  glass_outside_top_master;
        transformType   none;
        method          nearest;
    }
    glass_outside_bottom_master
    {
        type            mappedWall;
        inGroups        List<word> 
3
(
wall
mapped
glass_outside_bottom
)
;
        nFaces          5354;
        startFace       906640;
        neighbourRegion region0;
        neighbourPatch  glass_outside_bottom_slave;
        transformType   none;
        method          nearest;
    }
    glass_outside_bottom_slave
    {
        type            mappedWall;
        inGroups        List<word> 
3
(
wall
mapped
glass_outside_bottom
)
;
        nFaces          5354;
        startFace       911994;
        neighbourRegion region0;
        neighbourPatch  glass_outside_bottom_master;
        transformType   none;
        method          nearest;
    }
)

// ************************************************************************* //
