work/WinVent/Kastenfenster/S01/0.orig/T
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  12
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    location    "0";
    object      T;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
#include "${FOAM_CASE}/constant/initialisationConditions"

dimensions      [0 0 0 1 0 0 0];

internalField   uniform $!internalField/T;

boundaryField
{
    #includeEtc "caseDicts/setConstraintTypes"

    atmosphere
    {
        type            inletOutlet;
        inletValue      uniform $!atmosphere/T;
        inlet	    	uniform $!atmosphere/T;
    }

    outflow
    {
        type            inletOutlet;
        inletValue      $internalField;
        inlet	    	$internalField;
    }

    staticWalls
    {
        type            fixedValue;
	    value           uniform $!surface/T;
    }
    
    window 
    {
        type            zeroGradient;
    }

    glassWalls
    {
        type            compressible::thermalBaffle1D<eConstSolidThermoPhysics>;
        thickness       uniform 0.006;
        qs              uniform 0;
        qr              none;
        qrRelaxation    1;
        
        specie
        {
            molWeight       60.08;
        }
        transport
        {
            kappa           0.03408;
        }
        thermodynamics
        {
            hf              0;
            Cv              840;
        }
        equationOfState
        {
            rho             2500;
        }
    }
    
     
    glass_outside_top_master
    {
        $glassWalls;
        neighbourPatch  glass_outside_top_slave;
        value           uniform $!atmosphere/T;
    }

    glass_outside_top_slave
    {
        $glassWalls;
        neighbourPatch  glass_outside_top_master;
        value           uniform $!atmosphere/T;
    } 
    
    glass_outside_bottom_master
    {
        $glassWalls;
        neighbourPatch  glass_outside_bottom_slave;
        value           uniform $!atmosphere/T;
    }

    glass_outside_bottom_slave
    {
        $glassWalls;
        neighbourPatch  glass_outside_bottom_master;
        value           uniform $!atmosphere/T;
    } 

    

    /*".*"
    {
        type            zeroGradient;
    }*/
}

// ************************************************************************* //
