work/WinVent/Kastenfenster/S01/0.orig/epsilon
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  12
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    location    "0";
    object      epsilon;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //


dimensions      [0 2 -3 0 0 0 0];

internalField   uniform 5.70e-5;

boundaryField
{
    #includeEtc "caseDicts/setConstraintTypes"

    atmosphere
    {
        type            inletOutlet;
        inletValue     	$internalField;
        value           $inletValue;
    }

    outflow
    {
        type            inletOutlet;
        inletValue     	$internalField;
        value           $inletValue;
    }

    staticWalls
    {
        type            epsilonWallFunction;
        value          	$internalField;
    }

    window 
    {
        $staticWalls;
    }  

    "glass_.*"
    {
        type            epsilonWallFunction;
        value           $internalField;
        //value           uniform 1e-10;
    }

    /*".*"
    {
        type            zeroGradient;
    }*/

}

// ************************************************************************* //
