work/WinVent/Kastenfenster/S01/0.orig/nut
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  12
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    location    "0";
    object      nut;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //



dimensions      [0 2 -1 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    #includeEtc "caseDicts/setConstraintTypes"

    atmosphere
    {
        type            calculated;
        value           uniform 0;
    }

    outflow
    {
        type            calculated;
        value           uniform 0;
    }

    staticWalls
    {
        type            nutkWallFunction;
        value           uniform 0;
    }
 
    window 
    {
        $staticWalls;
    }

    "glass_.*"
    {
        type            nutkWallFunction;
        value           uniform 0;
    }

    /*".*"
    {
        type            zeroGradient;
    }*/
}

// ************************************************************************* //
