work/WinVent/Kastenfenster/S01/system/fvSchemes
 /*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  12
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSchemes;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

ddtSchemes
{
    default         Euler;
}

gradSchemes
{
    default         Gauss linear;
}

divSchemes
{
    default         none;

    div(phi,U)      bounded Gauss vanLeerV; // // Gauss limitedLinearV 0.3; //Gauss linearUpwind grad(U);
    div(phi,h)      Gauss limitedLinear01 1; //Gauss linearUpwind grad(h);
    div(phi,K)      Gauss linear;
    div(phi,(p|rho)) Gauss limitedLinear 1;//Gauss linear;
    div(phi,k)      Gauss upwind; 
    div(phi,epsilon) Gauss upwind;
    div(((rho*nuEff)*dev2(T(grad(U))))) Gauss linear;
    div(phi,CO2relativdensity)  bounded Gauss upwind;
    div(phi,specificHumidity) bounded Gauss upwind;
}

laplacianSchemes
{
    default         Gauss linear corrected;
}

interpolationSchemes
{
    default         linear;
}

snGradSchemes
{
    default         corrected;
}


// ************************************************************************* //
