work/WinVent/Kastenfenster/S01/system/createBafflesDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  12
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    object      createBafflesDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

internalFacesOnly true;

baffles
{
    glass_outside_top
    {
        type        faceZone;
        zoneName    glass_outside_top;
        
        patches
        {
            master
            {
                name            glass_outside_top_master;
                type            mappedWall;      
                sampleMode      nearest;
                sampleRegion    region0;
                samplePatch     glass_outside_top_slave;
            }
            slave
            {
                name            glass_outside_top_slave;
                type            mappedWall;      
                sampleMode      nearest;
                sampleRegion    region0;
                samplePatch     glass_outside_top_master;
            }
        }
    }
    
    glass_outside_bottom
    {
        type        faceZone;
        zoneName    glass_outside_bottom;
        
        patches
        {
            master
            {
                name            glass_outside_bottom_master;
                type            mappedWall;      
                sampleMode      nearest;
                sampleRegion    region0;
                samplePatch     glass_outside_bottom_slave;
            }
            slave
            {
                name            glass_outside_bottom_slave;
                type            mappedWall;      
                sampleMode      nearest;
                sampleRegion    region0;
                samplePatch     glass_outside_bottom_master;
            }
        }
    }    
}

// ************************************************************************* //